[
    {
        "text": "So I’m going to assume… there’s at least a CERTAIN percentage of people coming into this episode with an understanding of anarchism…that what an anarchist fundamentally believes is that we should overthrow the government… tomorrow. Oppositional defiance in other words. The FIRM belief… that I’m not gonna PARTICIPATE in this unjust institution called the government anymore, I’m not WASHING the DISHES tonight, so with all due respect SCREW YOU DAD. No as an anarchist MY evening is gonna be going down to the mall, I’m gonna buy a spiky bracelet from hot topic maybe steal a toaster…and then I’m gonna sit back and watch as society as we know it burns on down into ashes. That’s what a real anarchist does."
    },
    {
        "text": "But I think every serious anarchist out there would say that that view is at BEST, a delusional oversimplification of anarchism, and at worst: it is propaganda, propaganda that’s maintained by certain people because the REALITY of the matter to an anarchist… is that if every person out there KNEW the full story when it comes to anarchism as a political philosophy…they might find themselves with VIEWS on the nature of power, the way things are set up… that would be extremely problematic for some of the people that are CURRENTLY in charge of things."
    },
    {
        "text": "Noam Chomsky, great philosopher alive today, he was asked the question: what is anarchism to you? And his response is one that gives us a pretty good initial STARTING point for the discussion that’s to come…HIS answer was that ANARCHY as far as HE can see it…is that whenever there’s an authority that you witness in the world, PARTICULARLY a hierarchical authority that exists within a society…it is ultimately THAT authority’s job… to JUSTIFY its existence."
    },
    {
        "text": "No matter WHAT it is whether that’s the father in a family situation saying I’m the MAN of the HOUSE I make the decisions here. Whether that’s a PRIEST in a church. Whether that’s your assistant manager working at Dairy Queen. Whether that’s the CEO of a company, and YES whether that’s the government of the country you live in: ALL of these people no matter HOW GOOD their intentions are have a RESPONSIBILITY to JUSTIFY their position of authority."
    },
    {
        "text": "Because authority… is NOT a self-justifying thing…to Noam Chomsky. Not EVERY situation in the world REQUIRES some PERSON who’s APPOINTED where they have the authority to REIGN over and micro manage other people’s decisions. Nobody likes the mall security guard… walking around eating a wetzels pretzel, drinking an orange julius feeling entitled to mess with people’s days just because he’s got a uniform and a walkie talkie."
    },
    {
        "text": "Now IN the situations… where there’s a father who’s the MAN of the HOUSE and he’s making all the decisions…but in practice when MAKING those decisions he just ends up being a bumbling idiot that puts his family into a bunch of bad situations…an anarchist might ask the question: WOULD that family… MAYBE be a little bit better off if EVERYONE in the household was contributing to that decision making process? Can that father JUSTIFY his position of complete authority?"
    },
    {
        "text": "In the situation of the priest at the head of a church…where he tells his congregation hey you know, it’s the craziest thing I woke up this morning and God told me part of his plan today is that you all should mow my lawn and get me a glass of lemonade, won’t even GO into what priests have done to people HISTORICALLY in this position of authority…an anarchist might ask: would you say it’s necessary… for that priest to have to justify THEIR position of authority as well?"
    },
    {
        "text": "Well if you agree with THESE two examples…the question just becomes: how far up the ladder do we require people to DO this? Does it apply to the boss in a company that’s had the job for 20 years terrorizing people in cubicles? Does it apply to the government itself?"
    },
    {
        "text": "To Noam Chomsky all that an anarchist is…is someone who takes these questions seriously. Someone who believes… that it’s the TASK of the people who HOLD these positions of authority to DEMONSTRATE…WHY them being in charge… is serving everyone BETTER… than what WE could do on our OWN as responsible adults. They ask the question: what makes this person SO MUCH MORE QUALIFIED to know what’s best for everyone…than… everyone?"
    },
    {
        "text": "Because magically….when you and your friends are trying to choose where to go for dinner and there’s a disagreement between you…you DON’T need some sort of arbiter or governor overseeing that conversation to be able to come to a decision. When you’re parking in a parking lot…magically you don’t NEED a parking enforcement WARDEN to direct traffic and tell everybody where to park. People figure it out on their own somehow, democratically."
    },
    {
        "text": "So far from anarchism being JUST about overthrowing the government tomorrow: one general way of thinking of the sentiment of anarchism… is just to ask the question: can you think of ANY examples as you go through your daily life…where CURRENTLY, there’s a hierarchical authority in place that SUPPOSEDLY needs to govern over it… but to you it seems clear in some OTHER world we can imagine…the people amongst THEMSELVES could run that thing just as good or better, on their own. In other words, again, forget the revolution for now…an anarchist wants to FIRST ask the question: is there any way that we can be even slightly MORE FREE in these smaller situations that present themselves to us all the time?"
    },
    {
        "text": "To Noam Chomsky… if an authority cannot justify its existence…then it is OUR responsibility to dismantle it. And he’d say what you should ALSO consider AS YOU LOOK OUT for these examples of authority and you’re determining whether they’re necessary or not…is that if you’re one of these people that’s on BOARD with questioning the authority of say the domineering father…but to question the government… just seems ridiculous to you because what’s the world without a government? If we didn’t have the government everything would obviously just descend into absolute chaos…if that’s how you’re thinking: Chomsky would say consider for a second just how many groups there have been throughout history that have been SO entrenched in oppressive systems themselves… that they not only saw them as morally okay at the time…but sometimes they saw them as NECESSARY for the world to be able to function at all. For example:"
    },
    {
        "text": "Slavery. It is a well documented fact that there have been countless slaves that have lived over the course of human history, that because of the messages they received from the moment they were born, through indoctrination, through manipulation they SAW their life as a SLAVE…as something that NEEDS to go on for the world to function. There need to be free men…and there need to be slaves. That’s the natural order of things they were told. If all the SLAVES were freed…who would do all the work?"
    },
    {
        "text": "But despite the narrative that was accepted by the people being oppressed…was any of this true? No something they THOUGHT has to be good for them was actually holding them back."
    },
    {
        "text": "Another example Chomsky gives: women. Thousands of years of civilization where women are not able to vote, not able to get an education, be independent. Women were told, and MANY accepted that this is just the natural ORDER of things. Women’s role is to handle the domestic side of life and take care of the kids…men’s role was to go die in a war for some rich person or work himself into an early grave. Point is: these are OPPRESSED PEOPLE… society did not NEED to be structured this way… and yet many of these people believed this was a necessary part of what had to go on for the world to be able to function. Again something they thought was GOOD for them was ACTUALLY holding them back."
    },
    {
        "text": "Could it BE…that we have a similar level of acceptance for many of the institutions where power and authority lie in the world WE live in…an anarchist might ask: are we doing the exact same thing when we look at the government as it’s currently structured… and can’t imagine how the world would EVER survive without it?"
    },
    {
        "text": "Something important that needs to be said: there is no ACTUAL anarchist cookbook. There is no codified DOCTRINE of anarchy… and HOW it should be implemented. In fact if you hear somebody say “I’m an anarchist.” The truth is you actually know very little ABOUT them at that point. You’d have to ask a bunch of follow up questions."
    },
    {
        "text": "The reason why is because anarchism is a community FULL of free thinkers that are absolutely FINE with disagreeing with each other. And it makes sense it actually matches the spirit of anarchism overall: what you have is a community of people who fundamentally disagree with the idea of hierarchical authority…so you don’t generally have a bunch of people that read a single book… say, “SOUNDS good I guess!”, and then agree with everything that it says. What you end up with at times is a pretty FRAGMENTED community of people trying to find solutions… who AGREE on certain CORE issues, but differ on a lot of the details. It’s been said there are as many forms of anarchism as there are forms of authority that exist in society that it’s an anarchist’s job to question."
    },
    {
        "text": "Because of this: it’s very difficult to say ANYTHING about anarchism generally without leaving somebody out. I mean, even Noam Chomsky’s initial definition we just talked about…sounds pretty reasonable…but even still while I think almost all anarchists would agree with a piece of it…there’s also PLENTY of anarchists out there that would be FRUSTRATED if that were the only definition someone considered. Reason being is that anarchism is FAR from one of these ideas we’ve SEEN on the podcast before where a thinker will critique everything ABOUT society as we know it…and then when someone asks them, “so what should we DO about it?” They’re like, “I got nothing, honestly.”"
    },
    {
        "text": "No, in fact one of the endearing things ABOUT anarchism is how many alternative worlds they suggest that you can imagine what it would be like to live in. What I want to do with the beginning of this series is offer up a CLASSIC example of one of these, one that wouldn’t necessarily be applied JUST at the level of government, but could be the model for how OTHER hierarchical systems in society could be reimagined as well."
    },
    {
        "text": "So what I’m asking is for the sake of getting the most out of a philosophy podcast here today where we entertain ideas without necessarily accepting them…let’s all imagine that our belief that the world couldn’t function without the government… is similar to the belief that SLAVERY is needed for the ECONOMY to function. Just visualize yourself floating on a cloud of open mindedness. Welcome new ideas into your mind’s eye."
    },
    {
        "text": "Seriously though, picture this: as the anarchist thinker Errico Malatesta put it in one of his books, very visually…imagine someone that from the moment they were born their legs were bound together by a rope. But that DESPITE their legs being bound together…they were somehow able to learn to walk. Now, the rope tying their legs together… PROVIDES them with a certain kind of structure…and you can imagine this person saying thank GOD for this ROPE I have that helps hold my legs together…without it I would NEVER be able to walk. Scientists, philosophers in that world would come up with all sorts of stories about how NECESSARY it is to have your legs bound together if you EVER want to be able to walk…but little would ANYBODY in that society know that in fact ALL the rope is doing is limiting the strength and potential of the person if they were able to develop without that assistance."
    },
    {
        "text": "Maybe the BEST place to start talking about alternatives to government is to ask the question: what is the government anyway? I mean, we talk about the government as though it’s this abstract thing…the government is the WILL of the people. The government is the thin veil of justice between us and barbarism. But ANOTHER way of looking at it…more in line with the way an ANARCHIST might view the government…is that the government… is ultimately just people. The government is made up of governors. People… that are elected into positions that are permanent… in that the sense that the positions ALWAYS need someone IN the position at all times…and then these PEOPLE for a predetermined, mandatory length of time… make the decisions from the TOP DOWN on behalf of everyone."
    },
    {
        "text": "Many of the PROBLEMS anarchists are going to HAVE with this way of setting things up…are gonna be things that most people can relate to."
    },
    {
        "text": "In this setup: politicians often make promises to get elected and then don’t actually carry the promises out. That’s a thing. Another thing: there can often be a HUGE disconnect, between the lives of the elected officials, and the reality of things as it exists on the ground for the people that are actually LIVING in the society. Another problem: a relative handful of people who are elected…just in terms of their education…obviously are limited in their scope of understanding the problems that are going on, and also how to solve them."
    },
    {
        "text": "Hierarchies like this…are extremely fragile, power isn’t DIVERSIFIED enough it’s often said…meaning that ANY enemy domestic OR foreign can TARGET the few people that are in positions of power and then the entire system can break down as a result. Has happened many times before throughout history."
    },
    {
        "text": "Oversight and accountability in government, often becomes a problem. Corruption, is often a problem. In fact, an anarchist might say: with how CONSISTENTLY power seems to corrupt human beings…it’s almost as if almost NOBODY’S actually qualified to HOLD these hierarchical positions of authority."
    },
    {
        "text": "But even if you COULD sift out all the bad actors and all the incompetence… which doesn’t seem possible…but IF you could: how could you ever ELECT these people in a way that ensured what was best for society… and DOESN’T just reward the people who can find a way to manipulate people into getting votes? How could you ever PROVE a case… that this small cabinet of people that we’ve elected…are SOMEHOW better at knowing what’s best for everyone than the collective wisdom of everyone?"
    },
    {
        "text": "Now someone could say BACK to an anarchist here well there’s a PROBLEM with that, uh, grand plan of yours. We can’t LEVERAGE the collective wisdom of everyone…it’s impossible. This is why we VOTE to put our best and brightest at the helm of the ship. They’re mediators between all the conflicting interests that make UP a society. This is what ALLOWS people with differing opinions to coexist so well! Welcome to the 21st century you big dummy."
    },
    {
        "text": "But some anarchists would say back that to this RUDE person… that this is NOT what the people do… that we call “the government”. The government does not mediate. It dominates. What WE call the government… is simply the entity that’s out there… that has a barrel of a gun next to your head passing laws that restrict your freedoms that will lock you in a concrete cell if you don’t go along with whoever is in power right now. There’s that often quoted line about the Romans I’m not even sure if it’s a real line but it goes the Romans would conquer everyone in their path and they’d leave a wasteland behind them…and then they’d look back at that wasteland and they’d call it peace. Is peace, within society, is it achieved through mediation? Or through temporary bouts of domination? Interesting question to bring up at the dinner table."
    },
    {
        "text": "Now, MANY western societies these days are founded on values like liberty, equality, fraternity…etc. If it weren’t so sad an anarchist would probably die laughing at the idea that THESE are the values that are being offered. I think they’d say the WORDS you’re using there are good…but anarchists typically have a totally different definition of things like liberty and equality…in fact THREE values that are supported by MOST anarchists these days, the values that an anarchist society would try to structure their world around are famously liberty, equality and solidarity."
    },
    {
        "text": "But it NEEDS to be said to an anarchist… these three values are INTRINSICALLY linked together and each one of them NEEDS the other two if it’s going to be a TRUE version of what the value is. For example: it's been said in anarchist literature…that liberty…without equality…is just liberty for the most powerful or privileged within a society. But THAT’S not true liberty. Similarly, equality without LIBERTY…is just something like an outdated form of communism…it’s just slavery where everybody is forced to be the same."
    },
    {
        "text": "When it comes to solidarity…imagine instead of being forced to participate in the society that you’re born into…imagine a world where the only communities that you’re a part of… are ones that you’re voluntarily participating in. Communities of like minded people. People with similar goals where your cooperation with the group TRULY benefits you and THEIR cooperation with the group truly benefits them. Solidarity."
    },
    {
        "text": "Well solidarity needs both liberty and equality to be able to function properly as well…there’s no way people can voluntarily form these groups if they don’t have the liberty to choose which group actually benefits them…and without equality being a focus…in the sense that these groups are between people with an EQUAL voice within a democratic decision making process…without that there’s no way for a GROUP like this to be able to be formed in the first place."
    },
    {
        "text": "Now there’s SO much more to talk about with all three of these concepts especially what constitutes EQUALITY, we’re going to get to it in time: the point that needs to be made right NOW at THIS point in the discussion is that to an anarchist we need ALL THREE of these values working TOGETHER. Liberty, equality AND solidarity."
    },
    {
        "text": "And this type of community I just mentioned when talking about solidarity… is going to become a CORNERSTONE for how someone might reimagine a society that’s organized by people from the bottom up…one that DOESN’T require a hierarchical authority that’s making all the decisions."
    },
    {
        "text": "Cause see that’s one of the big misconceptions people have about anarchism…the idea that if you’re gonna say we shouldn’t have a typical western government as it exists today…which by the way is JUST to say that we shouldn’t have a government in the way humans have been doing it for about the last 5000 years or so…if you’re GONNA say that well then THAT must mean that to an anarchist… what THEY ACTUALLY want is ZERO organization between…a world where everyone’s in it for themselves…raw survival…everyone just build yourself a shack, heat up frozen bean and cheese burritos until a flock of toothless people come and take everything that you have."
    },
    {
        "text": "But nothing could be further from the truth. Anarchists are EXTREMELY… supportive of organization between people, to them it’s CRUCIAL for any society to be able to function…the DIFFERENCE is that they’re not fans of organization that’s formulated from the top down. Again the TYPE of organization that they think works better, the kind of organization we ALREADY USE in many procedures in everyday life…is going to be organization from the bottom up. Let’s talk about an example of how that might be possible."
    },
    {
        "text": "A common strategy you’ll see when imagining HOW an anarchist society may be structured…is that again instead of the top down model…you’d have what’s often described as a “decentralized, federated network of communities BASED on free association.” That’s one anarchist ALTERNATIVE that’s been offered to government as we know it."
    },
    {
        "text": "Now let’s break down each PIECE of that description. First up: communities that are based on free association…well that’s the idea we just talked about that it’s not only possible, but it’s actually BETTER in the eyes of an anarchist for people to ONLY have to be a part of the communities that they voluntarily participate in. Communities that ACTUALLY benefit you and everyone ELSE when you’re a part of them without having to have some sort of forced membership, coercion, the inability to LEAVE if you realize one day that the group’s no longer helping you. Why can’t things be structured in a way where you’re only part of communities that you want to be a part of? Yet ANOTHER interesting question for the dinner table."
    },
    {
        "text": "Anarchists generally think this is possible…and to most anarchists to respect liberty, equality and solidarity… a community like this would HAVE to be… a democracy. But not…a representative democracy…not a democracy where one elected official can be lobbied and bribed in a disproportionate way…but a TRUE democratic collective… where the power is at the base…where the people being impacted BY the decisions that are being made… are the ONES VOTING on what should be DONE. One person, one vote, BY the people that are affected by the vote. That’s the way it should be to many anarchists."
    },
    {
        "text": "Now, USING this same process…no doubt there’s gonna be situations that come up where leadership is needed in these communities to do any NUMBER of things…to keep things organized, to logistically execute the decisions that are voted on, WHATEVER IT IS…WHENEVER there is a TEMPORARY NEED for someone to hold more power than others that are in the group…there would NOT BE a permanent, elected position, like in many CURRENT forms of government…there’d be no fixed office that ALWAYS needs someone occupying it to be able to justify its existence…instead in THESE sorts of communities…a TEMPORARY need for power, would be met with a TEMPORARY…delegation of responsibility to a person or a council of people that the group democratically sees fit."
    },
    {
        "text": "Then, this temporary office… would be heavily supervised by the REST of the community that they’re representing…where IF the community… SEES what these delegates are doing with their power and at any point doesn’t like what they see… the community can democratically and instantly, REVOKE the position of power and hold a new vote for how to proceed in the best way moving forward. Thi s is FAR more flexible."
    },
    {
        "text": "Keep in mind again that ANY individual that thinks the group’s become corrupted by some sort of faction that’s controlling the vote numbers…that person can LEAVE and join another community at any time. What this setup DOES to an anarchist is FLIP the power dynamics on their head. Instead of the people in POWER being able to monopolize the lives of everyone else regardless of how much they even KNOW about the REALITY of the lives of the people they’re governing…this setup would make it so that… if ANYTHING…the BASE of people make the life of being a governor… something slightly annoying… because at EVERY step along the way if you’re in a position of AUTHORITY…you HAVE to justify your power to the rest of the group and SHOW why it's best for everyone. This is why a lot of anarchists say that to even CALL this type of setup… authority…is just inaccurate. It’s no longer DOMINATION…it’s delegation. The people in positions of “power”... are really just a mouthpiece for the base of people who TRULY hold the power… if this was the way it was setup…the delegates would hold very little if ANY power themselves."
    },
    {
        "text": "Now let’s slow down for a second. Cause somebody could say BACK to this anarchist…well that sounds great in theory. I mean, sure, we all KNOW that a direct democracy where everybody gets one vote works well when it comes to SMALL groups of people, when you’re deciding what movie to go see or where to go for dinner. But how is this in ANY WAY… SCALABLE to a society… where there’s 100 million people whose interests we need to consider?"
    },
    {
        "text": "Well let’s remember… our description of an anarchist alternative to the forms of government we have today…organization would happen under what we called: a decentralized, federated network of communities based on free association. Well to answer the question from the skeptic here…THIS is where the decentralized, federated part of the equation comes into play."
    },
    {
        "text": "I mean, as you can imagine… in a complex society that’s trying to manage life in the best way we possibly can… there would naturally be… a LOT of these communities between people that would be formed. Under one POSSIBLE way of setting things up, that itself would ALWAYS be open to improvements: but under one strategy there would BE no centralized federal AUTHORITY that organizes all these communities together. Again, the organization… would come from the bottom up. Communities could form unions with other communities insofar as both of them benefit from voluntarily agreeing to work together. These unions could form together into confederations through the same voluntary process…with the same flexibility to back out should things not be working well."
    },
    {
        "text": "And WHEN decisions inevitably need to be made for this larger federated, network of communities…the SAME bottom up organization can be applied at THIS level as well."
    },
    {
        "text": "A decision needs to be made. A mass assembly will be held for all the people that are involved in that decision. If necessary there will be an election of temporary, highly supervised delegates to act as mouthpieces FOR the federated community… where once the decision has been carried out and put into practice in the world… that temporary office would dissolve, until a new one is needed for a NEW decision that needs to be made. Again the THINKING is that the power is ALWAYS in the hands of the people that are being impacted by the decisions."
    },
    {
        "text": "Someone could say back to this well that type of setup worries me…doesn’t this just potentially fragment people and their ideas for how society should function even further than they already are fragmented right now? Doesn’t this setup just put us on the fast track to total chaos and a lack of order in the world? Don’t we NEED clear political lanes for people to fall into?"
    },
    {
        "text": "Well, an anarchist might reply with the fact that the exact same thing… was said about democracy, during times when monarchies and oligarchies were all the rage. It used to be said: what kind of moron…would ever open the floodgates and allow EVERYONE a voice when it comes to how society should be structured…you know, THEIR version of molotov cocktails and spiky bracelets from hot topic…what’s that thing from Game of Thrones…the average person voting? Hahah. What should my COW get a vote as well? Should my DOG get a vote? Come now."
    },
    {
        "text": "Anyway, REGARDLESS of whether you’re sold on alternative forms of organizing society…if you’re entirely NEW to anarchist thought there may be some incredibly clever people out there who SEE where all this is going. IF what an anarchist is concerned with is hierarchical authority WHERE EVER it may exist in a society. IF we are entertaining the idea that we may be like slaves or other oppressed people of the past who have been indoctrinated to see the power structures that are dominating our life as NECESSARY for life to be able to function. And KNOWING that for the last several episodes we’ve been talking about Foucault, and Deleuze and Byung Chul Han and Agamben and this contemporary analysis of WHERE power actually EXISTS in the world. Some anarchists may ask the question: are we maybe focusing a bit too much here on the government side of things?"
    },
    {
        "text": "I mean to worry about the government and the level of control it has over our lives…to talk about the abolition of the state…the recreation of a new one…is that even the world we LIVE in anymore?"
    },
    {
        "text": "What we have in TODAY’S world to someone like Noam Chomsky is something entirely different than when anarchism took off in the 19th century. We have privatized tyrannies… that we call corporations… that control the materials that people build their life with. We have a media apparatus… that controls the ideas… that people build their worldview with. We have more brick and mortar institutions that control the norms and taboos we use to understand ourselves and each other. ALL of these…are NOT things that the government oversees and controls. In fact the reality is that the government is often too weak to protect people AGAINST tyrannies like these… because a tyranny doesn’t need to have the same checks and balances as a government often does. Corporations end up controlling the government, not the other way around. Media often dictates who even gets elected."
    },
    {
        "text": "What someone like Noam Chomsky would say to anyone talking about ABOLISHING the state tomorrow…is that WHEN you say something like that…you INSTANTLY relegate yourself to some sort of distant academic seminar where you’re no longer even TALKING about making things better in the world AS IT IS. To say that you’re clearly not even interested at meeting people at WHERE THEY ARE NOW."
    },
    {
        "text": "He says maybe if we HAD something like that federated network of communities all capable of cooperating with each other AFTER the abolition of the state…MAYBE then, that could be a conversation to be had. But as it exists right now…we don’t have anything that even REMOTELY RESEMBLES that."
    },
    {
        "text": "Like if your GOAL is to ultimately dismantle unjustified forms of power…which is more of a problem he would ask? Corporate power or state power? He says ALL that you’d be doing if you overthrew the state right now…is just make corporations even MORE powerful on the other side of it. To him, just taking an inventory of where we’re actually at…the more REALISTIC, SHORT term goal is to USE the regulatory power of the state… to dismantle the sweeping authority of the private sector and its GRIP on people’s lives. You know as imperfect as it may be…to Chomsky, sometimes you need ONE authority in the short term… to help deal with another authority that’s more urgent and problematic."
    },
    {
        "text": "Anyway when you consider all the thinkers we’ve been talking about lately, the digital panopticon and you have a contemporary understanding of where power actually lies in the world…anarchism is going to be a really interesting lens to view it all through… and the people INVOLVED in the discussion are going to have some pretty INTERESTING alternatives for how things may be structured in an alternative way WITHOUT hierarchical authority."
    },
    {
        "text": "These recent episodes can LEAVE people a little confused as to how we’re even supposed to move forward…well from this anarchist perspective: what if the REASON it’s confusing is that we’re just ASSUMING that ANY path forward NEEDS to include hierarchical authority…and that it’s THAT limitation, that’s ultimately holding us back from having clear answers…not unlike Malatesta’s child that we talked about that was born with their legs bound together… that somehow learned to walk anyway."
    },
    {
        "text": "Next episode we’re talking about MORE of these alternatives, criticisms for WHY these ideas can never work, the responses to those. What I ask of you listening is this: I see you…that type of person out there that’s listening where you have that feeling in your stomach of wanting to ask a question for how ANY of these anarchist ideas would work in certain situations you can imagine. PLEASE…for the sake of next episode being as good as possible for EVERYONE…if you HAVE one of those questions…find some way to get it to me. Put it in the comments, ask on instagram or X twitter…email it to me. Swear to god this isn’t one of those tell us what YOUR favorite holiday moment is in the comments below! I just want to make as GOOD of an episode as I can for the people that listen to this. Could never do this without you. Thanks again for everything."
    },
    {
        "text": "Thank you for listening. Talk to you next time."
    }
]