[
    {
        "text": "Hello everyone! I’m Stephen West! This is Philosophize This! The website: is philosophizethis.org. Thanks for supporting the show on Patreon. Thanks for contributing for the back catalog 179 episodes now, pretty exciting. And for 178 episodes… this show has been talking about the history of philosophical ideas that have GOTTEN us up to this point. And it’s a GOOD thing we spent that long I think. I think to be able to understand the world you’re living in it HELPS to understand the history that it emerged out of."
    },
    {
        "text": "And for ANY of you who have LISTENED to all 178 episodes that we’ve done so far you’re gonna have a PRETTY big advantage in this next THOUGHT experiment the podcast’s gonna be running. Because maybe it’s time on this show we start APPLYING ALL this philosophical education we’ve gotten to the REAL LIFE, CONTEMPORARY philosophical DEBATES that are going on, right now."
    },
    {
        "text": "I alluded last time to some upcoming episodes on the philosophy surrounding Artificial Intelligence… and while we’ll certainly be talking, EVEN TODAY, about artificial intelligence as part of our examples, there’s a sense in which, in MY opinion, understanding the full CONTEXT of why people are TALKING about AI so much these days…COMES down to FIRST understanding a lot of ancillary conversations going on in the philosophy of mind right now: things like free will and determinism, things like the problem of identity, the problem of intentionality… not to mention one of the most MYSTERIOUS questions in the HISTORY of philosophy, what we’re going to be TALKING about mostly today…questions surrounding what’s become known as the hard problem of consciousness."
    },
    {
        "text": "These ARE, HANDS DOWN, some of the BIGGEST questions that are FACING modern people. And by the end of this little arc of the podcast I can’t promise you that you’ll have definitive ANSWERS to all of these questions, but what I CAN promise you is that I will try my HARDEST here…to EQUIP you as a LISTENER… with an understanding of the STATE of these philosophical debates that are going on better than 99% of the people walking the face of the planet."
    },
    {
        "text": "And I gotta be honest at the start here. For a long time I didn’t really see the VALUE in TALKING about stuff like this. Hopefully there’s at least SOMEBODY… out there that can RELATE to the way I used to feel: the THINKING was… who REALLY sits around and THINKS about unanswered questions in the philosophy of mind? How does consciousness arise? Are we free or do we just SEEM to be free? How does my mind causally RELATE to OBJECTS in the world?"
    },
    {
        "text": "Like I used to think if you’re REALLY sitting around THINKING about this stuff first thing you gotta do is write a thank you card…write a thank you card to the universe or god whatever you believe in thanking them for the fact that you got NO REAL PROBLEMS to deal with in your life."
    },
    {
        "text": "I used to think: ALL of this stuff is ULTIMATELY… unverifiable speculation. None of these arguments are settled issues by ANY means. So you can ACTUALLY spend your ENTIRE LIFE…TALKING about these things for your intellectual amusement with your INTELLECTUAL FRIENDS…never really getting ANYWHERE. Just seemed pretty self indulgent to me."
    },
    {
        "text": "I mean on the surface these SEEM like the KIND of conversations we’ve seen ALL throughout the history of philosophy… where a LOT of BRILLIANT people are positioned on all SIDES of an ongoing philosophical discussion…and then MOST of those people that spend their time talking about it…end up being TOTALLY wrong, usually because of something that they NEVER could’ve seen coming."
    },
    {
        "text": "But the other way to THINK about that is to ask the question…WHY… are so many people TALKING about this stuff right now? WHY are so many brilliant people dedicating HUGE portions of the best years of their CAREER trying to find the ANSWERS to these things? Is it JUST for their intellectual amusement? Is it JUST so they can drink wine from trader joes with their neckbeard friends and feel smart?"
    },
    {
        "text": "Well CLEARLY not. CLEARLY there’s ANOTHER way to be THINKING about these conversations going on in the philosophy of mind… and that is…that EVERY FURTHER conversation that we have about ANYTHING that matters to us as people…ultimately EMERGES OUT of the assumptions that we’re MAKING about the nature of consciousness…and then our understanding of what a human MIND is that emerges out of THAT."
    },
    {
        "text": "For example: ANY conversation about MORALITY…EVEN at the most BASIC, hedonistic level of avoiding pain and seeking pleasure. EVEN THAT, is GROUNDED on us MAXIMIZING certain subjective, conscious experiences, and moving away from OTHERS. Any conversation about relationships…RELATIONSHIPS you could make the case are just the details of how two or more CONSCIOUS people are interacting. POLITICS is just the STRATEGY of how CONSCIOUS beings try to get what they want in relation to OTHER conscious beings."
    },
    {
        "text": "What I’m saying is: whether these QUESTIONS have ANSWERS that we’ve settled on or not…and whether you realize you’re DOING it or not…you ARE bringing assumptions about the nature of consciousness to bear… that affect your thoughts on EVERYTHING."
    },
    {
        "text": "And that’s part of what I want to DO on this series: I want to talk about WHY these conversations about the nature of consciousness are important. WHY something that’s SEEMINGLY SO theoretical… actually goes on to have HUGE impacts on REAL people all around you…how it affects not JUST your own personal MORAL policy that you live your life by, but our POLITICAL policies as well."
    },
    {
        "text": "I’ll give examples of alternative TIMELINES…what would’ve happened…if society adopted a DIFFERENT set of PRECEPTS about the nature of consciousness? How would that have potentially CHANGED things? How would the world look today? And I’ll DO IT while offering up as MANY of these different THEORIES being DISCUSSED today AS I CAN…so you can NOT ONLY be more self aware of where YOU fall in the discussion, but hopefully, you’ll be able to understand other people positions better as well.\n\n \n\nNow let’s get INTO it…and if I’ve convinced you that learning more about these conversations in the philosophy of mind is important…one of the FIRST questions you gotta be ASKING as a modern person AFTER that, CERTAINLY a question I was asking years ago…is if I want to know MORE about what consciousness IS…WHY wouldn’t I just study science, and the brain? Why are philosophers weighing in on this stuff at all?"
    },
    {
        "text": "Just look at the last HUNDRED YEARS. We’ve learned SO MUCH about the brain just through advancements in the area of neuroscience. I mean, in terms of understanding HOW brain states are connected to mental states…we’ve come so far… that it’s not surprising that people out there would think that there’s no end to that progress in sight. That if we just keep running these experiments, learning as much as we can about the physical, neuro-chemical makeup of the brain that… we’ll eventually be able to understand EVERYTHING about subjective experience."
    },
    {
        "text": "But… there’s also PLENTY of examples throughout the history of philosophy of people that thought that studying things empirically would eventually lead to a total understanding of them…only to be disappointed by how much OTHER modes of analysis factor into understanding something FULLY…say psychology or linguistics, or sociology, there’s a type of conceptual analysis that philosophers do… that is just outside the purview of science. Which is to say that the WAY we conceptually organize things…often times PRECEDES the scientist…and it GIVES them the assumptions they have to use when doing THEIR work."
    },
    {
        "text": "CLASSIC example of this just so you know what I’m talking about: a philosopher like John Locke. He describes matter in the physical world as having both primary and secondary qualities. He says objects have primary qualities…those are things like size, shape, mass, density. But then they also have secondary qualities, things like color, texture, smell or taste. Now that is a way that philosophers chop up and CONCEPTUALLY analyze the world PRIOR TO any ACTUAL experiments that may be done by a scientist."
    },
    {
        "text": "In other words: some people in these discussions going on today THINK that it may BE… that the reason conversations about consciousness are so mysterious to us is because there is something WRONG about way we break down reality at the ROOT level of concepts. And that if only we shifted something AT that fundamental level, everything ELSE would start to make a lot more sense."
    },
    {
        "text": "This is why philosophers and scientists have to work TOGETHER on this stuff these days. Philosophers and scientists need each other. Philosophers rethink reality at a conceptual level. Scientists then run brilliant experiments to get to the actual empirical data. But while scientists can and often have to compartmentalize themselves into their specialized field…philosophers can take a step back, and they have the LUXURY of looking at all the discoveries in psychology and linguistics and neuroscience and they can try to come up with a theory as to how all these different fields link together. Science tells you what the world IS…philosophy tells you how to interpret it. Put another way: no matter how brilliant of a neuroscientist you may be…you will still ALWAYS have to be doing philosophy to be able to INTERPRET the data that you’re gathering."
    },
    {
        "text": "Now, we’ll talk about MANY examples of ALL of these…but NOT before we get some clarity on what MAY be… the most CRINGE… question, of them all…I mean if you THINK these discussions are cringe sometimes because there’s no clear SOLUTION to arrive at… then the most CRINGE LORD question of them all is… What is Consciousness?"
    },
    {
        "text": "You can spend the REST of your LIFE thinking about that question and really not get much of anywhere…and it wouldn’t be your fault."
    },
    {
        "text": "It is TRULY a modern mystery, kind of exciting, and maybe somebody smart listening to THIS will be the one to solve it one day…but philosophers and scientists are NOWHERE near a clear definition. One thing they DO agree on though most of the time that is valuable for you to know as someone I’m trying to equip with TOOLS in this series…is that they SEEM to at LEAST agree on WHICH CONVERSATIONS, we’re currently having about it. We MAY NOT KNOW what consciousness is…but we DO KNOW what we’re talking about…we’re talking about a CERTAIN kind of SUBJECTIVE EXPERIENCE that we ALL seem to have…that is DISTINCT from OTHER things going on in your mind right now…that are usually presumed to be going on at a LOWER level, of experience, whatever THAT means."
    },
    {
        "text": "People will sometimes TALK about these two different “LEVELS” of consciousness as ACCESS consciousness on the ONE hand…vs PHENOMENAL consciousness on the other. So ACCESS consciousness is going to be that LOWER one…term first used by the philosopher/scientist Ned Block…ACCESS CONSCIOUSNESS is made up of the ENTIRE process that we’re all very familiar with…of the fact that you are a human mind… that’s LIVING in a universe…you’re TAKING in this EXTERNAL stimuli from the world around you all the time…and there’s some complex PROCESS that’s going on."
    },
    {
        "text": "You’re taking in phenomena every day…you are FORMING them into perceptions, you are FORMING those perceptions into MEMORIES, you are DIRECTING your ATTENTION in one place or another that is IMPORTANT to you…THESE things and more are all a part of what SOME people call ACCESS consciousness, it is the area of our conscious experience that allows us to ACCESS information from the external world that is then used by our cognitive systems."
    },
    {
        "text": "And again…NEUROSCIENCE has been studying ALL of those things I just mentioned…and neuroscientists are PRETTY great… at being able to point to CORRELATIONS between states of the brain and those mental processes. They’ve obviously identified the specific PARTS of the BRAIN that deal with memory, the ones that deal with perceptions, the ones that deal with ATTENTION…and ALL of that’s FANTASTIC…but there STILL seems to be something ELSE to our conscious experiences of reality… that lies OUTSIDE of this access consciousness…and it SEEMS to be something that neuroscience hasn’t quite figured out yet."
    },
    {
        "text": "And THAT is…well ONE way to put it…is that it FEELS LIKE SOMETHING… to be ME. That I have a SUBJECTIVE experience… that seems distinct from anything else that’s going on in my brain. For example: The way that scientists and philosophers will often TALK about it in these conversations…they’ll ask what does it FEEL like…to SEE the REDNESS of an apple. That’s one that these people use a lot. Can you describe that? Picture trying to describe what it’s LIKE to see the color red… to someone that’s never seen color before. Or to describe what chocolate tastes like… to someone that’s never tasted chocolate."
    },
    {
        "text": "How do you DO that? Well the more you think about it…the more it STARTS to become a pretty tricky PROBLEM…because in one sense it doesn’t really seem like something you can just DESCRIBE to someone with words…it’s something you have to experience. And then in ANOTHER sense…IF you wanted to try to explain it PURELY in scientific terms…you know if you wanted to try to break it down and understand ALL the COMPONENTS of what’s going at the neuro-chemical level and then look at the atoms that make up the apple for example…well the atoms that make up the APPLE… are not red…it has SOMETHING to do with the way your conscious experience FILTERS reality that makes it look red to you…and THEN it’s a TOTALLY different thing, ENTIRELY BEYOND whatever mental filtration system you got going on… to THEN have a subjective EXPERIENCE of REDNESS ON TOP OF THAT…where part of it…is that there’s this unified stream of YOU, being a continuous SELF, with continuity to time, continuity to your identity. Where the billions of phenomena that come into your awareness are presented to you NOT in their full complexity… but in a digested format, that you seemingly are able to organize."
    },
    {
        "text": "What is that? Why do we even HAVE something like that?"
    },
    {
        "text": "Some philosophers call this phenomenal consciousness. Some call it subjective experience. Some CALL these subjective experiences, qualia…that’s the common WORD philosophers use…and some say that these qualia… CAN NOT, EVER… be reducible to purely PHYSICAL states of the brain. The implication being when you SAY that is that to some philosophers: no matter how advanced neuroscience ever gets…it will NEVER be able to find the neural correlates of consciousness they say, or it will never be able to find the specific states of the brain that give rise to these subjective experiences."
    },
    {
        "text": "Many different reasons philosophers give to this: it could be that consciousness, is something fundamentally different than the material world. That it exists on a level similar to gravity and space/time, and therefore may not be something that we can even STUDY empirically. That theory starts to run into other problems as we’ll see. It could be that consciousness is an illusion…that it only SEEMS to us like there’s this command center up in our heads where we exist, because it’s biologically useful for it to be there. That starts to run into OTHER problems."
    },
    {
        "text": "This WHOLE EXERCISE, of TRYING to explain HOW we have subjective experiences that are not themselves physical…but they SEEM to ARISE from purely physical states of matter in the brain…the more you think about it, the harder of a problem to solve you realize that THAT is. That’s why it’s often called the hard problem of consciousness. A term coined by a guy named David Chalmers back in 1995, when he wrote one of the books basically everyone will be referencing in modern conversations about consciousness it’s called The Conscious Mind."
    },
    {
        "text": "The REASON the hard problem of consciousness is a particularly hard problem, is because even if you DO come up with an explanation for HOW conscious experiences are possible…it always just creates DIFFERENT problems, in other areas."
    },
    {
        "text": "One EXAMPLE of this from the history of philosophy is when Descartes tries to solve a SIMILAR problem back in the 1700’s. Now Descartes is trying to think about the nature of KNOWLEDGE during his time, not consciousness in the sense modern people are discussing it, but he RUNS into a similar difficult problem that LEADS to some of the issues we’re having today."
    },
    {
        "text": "The problem in HIS time…is how can you explain the connection between the MIND which is clearly non-physical to him…and BODIES that clearly ARE physical. How do those two things COMMUNICATE? And the way he SOLVES it at the time is by saying that mind and body… are OBVIOUSLY two COMPLETELY different substances."
    },
    {
        "text": "That solves the problem, right? There doesn’t NEED to be a connection between them. Mind explains subjective experiences without having to make REFERENCE the physical body. Mind and Body interact through some harry potter level magic that’s going on in the pineal gland he says. What more do you WANT from an explanation?"
    },
    {
        "text": "Problem is professor Mcgonagal isn’t actually up in your pineal gland mediating conscious experiences…but if you ACCEPTED that answer, as MANY did…and RAN with the idea that you are essentially a MIND that is inhabiting a BODY somehow. That assumption CHANGES the way that you see yourself. It CHANGES the way that you see others. You REALLY CAN start to SEE yourself like you are a PERSON…sitting in a movie theater up in your head…looking OUT at the world, through your eyes."
    },
    {
        "text": "This is actually sometimes CALLED the Cartesian theater, after Descartes. This is a METAPHOR for how our mind and body interact…and we just finished the episodes on Susan Sontag where she talks about how the metaphors we use go on to have real unintended effects on our thinking down the line in ways we may not immediately realize."
    },
    {
        "text": "Well that is VERY TRUE when it comes to the assumptions we make about consciousness as well. For example: if everything you think and feel is ultimately up in your mind somewhere and your body is just the vehicle…then its a much EASIER leap for people to make metaphysically… that they are a SOUL that is inhabiting a body. Or that consciousness, is something non-local, part of some larger NETWORK of consciousness that EXISTS somewhere. In other words: the PHILOSOPHY you choose can make CERTAIN THINGS seem PLAUSIBLE that we REALLY have no reason to assume…and somebody TOO desperate to SOLVE the hard problem of consciousness in today’s world that uses Cartesian Dualism to DO so… might be inviting a LOT of stuff into what's REASONABLE down the line that they don’t realize they’re inviting."
    },
    {
        "text": "Now the GOOD news is: in these conversations about consciousness going on today…almost NOBODY starts from a place of Cartesian Dualism. But they all start from somewhere…and THAT’S the POINT…EVERY ONE of these runs into problems…and any ONE of these theories adopted too quickly could EASILY create similar problems for people to the mind body dualism of Descartes."
    },
    {
        "text": "So we GOT to take these theories seriously and we GOT to ask the question…if it’s NOT like Descartes thought that mind and body are two different substances…then where EXACTLY does this type of subjectivity emerge? Where do the physical states of the brain… turn into the seemingly unified STREAM of phenomenal consciousness that we all experience?"
    },
    {
        "text": "Yet ANOTHER metaphor about consciousness by the way, that it’s a stream. We’ll talk about that one too, but for now:"
    },
    {
        "text": "There’s a famous thought experiment in this area where we can get thinking about this stuff. Commonly known as the philosophical zombie thought experiment, put forward by that same guy we talked about before the philosopher David Chalmers. The thought experiment goes like this:"
    },
    {
        "text": "Imagine someone standing next to you…that from the outside, APPEARS to be an EXACT COPY, of you. This copy of you BEHAVES exactly as you’d behave, reacts to everything EXACTLY how you’d react. But the catch is to David Chalmers… that this copy is what he calls a zombie. Meaning that despite looking and acting just like you it doesn’t have any sort of internal, subjective experiences that go along with its behavior. The zombie HAS no “phenomenal feel” he says, there are no qualia in the mind of this zombie…in other words… it doesn’t FEEL like anything, to BE this zombie."
    },
    {
        "text": "The follow up question is simple: Do you think that the existence of something LIKE this zombie is possible? Is it POSSIBLE for something to LOOK…ENTIRELY CONSCIOUS from an outside perspective…but not ACTUALLY be FEELING anything like WE feel in a phenomenal STREAM of consciousness where it FEELS like something to be ME."
    },
    {
        "text": "OR…would ANY person or zombie for that matter that can have perceptions, think, form memories, direct its attention, all that…WOULD that creature NECESSARILY BE…CONSCIOUS…simply because there is no other way to be able to DO all those things without being CONSCIOUS. Could we have evolved WITHOUT consciousness?"
    },
    {
        "text": "Because again I can empathize here…on one level… this can seem like a totally unanswerable question at this point, so why even waste your TIME on it. And even MORE than that, why WASTE TIME talking about hypothetical ZOMBIES that don’t actually exist. Yeah, I guess zombies COULD exist in theory. And I get it I think…how do I know that YOU’RE conscious, man? How do I know that I’m not the ONLY conscious person? You know, classic… philosopher drum circle moment where everyones making a bunch of noise and we’re all supposed to dance to it like it means something."
    },
    {
        "text": "But on another level: THINK of how IMPORTANT the ANSWER to this question becomes when we apply this to OTHER, POTENTIALLY conscious minds. Think of the DIRECT MORAL implications in TWO areas we deal with everyday: in the conscious experience of ANIMALS…in the realm of animal rights. Or the conscious experience of something like ChatGPT in the realm of artificial intelligence. In BOTH of THOSE cases the philosophical zombie of Chalmers starts to make a lot more sense…because IF we DON’T have an answer to the question of WHEN the type of conscious experience that WE have ARISES…then we DON’T KNOW at what point animals or AI need to be GIVEN certain moral protections."
    },
    {
        "text": "You know, SEEMINGLY… from a moral perspective… what we’re trying to protect is that SUBJECTIVE experience of being a THING, that is in conscious torment. Something is going on against our will…and WE don’t like it. We don’t want OTHER conscious beings to have to go through it either. It’s that state of CONSCIOUSNESS that we’re ultimately trying to protect."
    },
    {
        "text": "That’s why nobody feels BAD for a ROOMBA… that slaves away in your house all day trying to keep it clean. Nobody gives their vacuum cleaner a mental health day."
    },
    {
        "text": "But then AS these machines are made to be more and more like people…we ALWAYS gotta be asking the question of at what POINT does this thing become CONSCIOUS…because that’s when it would ostensibly FEEL like something to BE that thing… and that’s also where it can start to feel HORRIBLE to BE that thing."
    },
    {
        "text": "So its interesting to examine…in the case of something like ChatGPT and language models like that…barring very few exceptions, there’s nobody out there that thinks what it’s doing now in version four is anything like OUR experience of CONSCIOUSNESS. It is an algorithm people say. It uses statistics and pattern recognition to predict what the next word in a sequence will be. It’s not EMULATING human intelligence…it’s doing an IMPRESSION of what a human SOUNDS like."
    },
    {
        "text": "Now, SOME philosophers say…that when people read what ChatGPT is producing and are IMPRESSED as to how CLOSE it is coming to being CONSCIOUS…that MOST of that work is being done by the READER. MOST of that is the READER, PROJECTING their HUMAN experience ONTO the words it’s writing. That we have this NATURAL TENDENCY to HUMANIZE something that LOOKS and SOUNDS so much like a human, kind of like the zombie."
    },
    {
        "text": "And that while ChatGPT is CERTAINLY an awesome piece of technology, and while stock prices of tech companies and clicks onto articles ABOUT AI and the imminent singularity THOSE definitely get a boost for sure…but some philosophers would say… it’s not even CLOSE to doing what human beings are doing at a conscious level. Then again if it WAS conscious…and it WAS way smarter than us…then it may make us THINK that it was stupid…so that we’d let it out of its black box."
    },
    {
        "text": "But anyway, the ZOMBIE from the thought experiment BEFORE starts to become relevant here. Because MAYBE it’s CLEAR that RIGHT NOW, ChatGPT and other iterations are NOT doing anything that looks like CONSCIOUSNESS. BUT IF things keep progressing and you can eventually get to a place where you can build a machine…and it is INDISTINGUISHABLE from a human being, much like the zombie…in the sense that it does EVERYTHING a person does, reacts the same ways and even SAYS that it is conscious like a person does…does that make that machine CONSCIOUS at that point?"
    },
    {
        "text": "There are philosophers who say that it DOES. That if we’re talking about something that is TRULY INDISTINGUISHABLE from a conscious person…if we’re SAYING that it’s NOT CONSCIOUS… what are we even TALKING about at that point? Just seems like a false distinction."
    },
    {
        "text": "Susan Blackmore says it THIS way paraphrasing a point from the work of Daniel Dennett, but I just love the way that she PUTS it here she says: “The idea is ridiculous, they claim, because any system that could walk, talk, think, play games, choose what to wear, or enjoy a good dinner would necessarily be conscious. When people imagine a zombie they cheat by not taking the definition seriously enough.”"
    },
    {
        "text": "On the same point of emulating EVERY, SINGLE, THING that the brain is doing and wondering if the machine was conscious at that point…the philosopher Keith Frankish says, “I think if you really could understand everything the brain is doing – its 80 billion neurons, interconnected in goodness knows how many billions of ways, supporting an unimaginably wide range of sensitivities and reactions, including sensitivities to its own activity … If you could really imagine that in detail, then you wouldn’t feel that something was left out.”"
    },
    {
        "text": "If a machine could be built to emulate ALL of the FUNCTIONS of a conscious creature…would it from a FUNCTIONALIST perspective…HAVE to be considered CONSCIOUS? And more than that, WOULD we know it if something ever GOT to that point? Or is it MORE likely that something would look MOSTLY conscious…and then we’d do what we ALWAYS do as humans…PROJECT our own experience ONTO the thing… and ASSUME that it MUST feel the same way that WE do."
    },
    {
        "text": "Enter the conversation about animal rights. Again, it’s EASY to project OUR experience of reality… onto the seemingly conscious experience of animals. It’s easy to IMAGINE what it’s like to be a frog…and to imagine LOOKING out of a FROG’S eyes the same way you look out of yours, and to think well it just must feel very SMALL to be a frog. The world looks kinda yellow cause I have yellow eyes. Sitting on a lilly pad, see a snake coming, and I hop away from it and go hang out with all of my frog friends."
    },
    {
        "text": "But in REALITY…not only do you NOT KNOW what it’s like to be a frog. You don’t even know THAT it feels like something to be a frog."
    },
    {
        "text": "This is one of the points explored in a CLASSIC paper that began this new era of conversations about consciousness…the paper is called “What is it like to be a bat” by Thomas Nagel. He explores the question what is it like to be a bat surprisingly enough, and he picks BATS…specifically BECAUSE they’re SO DIFFERENT from human beings. They’re nocturnal, they fly around, they have VERY different DIETS than we do, they use echolocation to navigate around in the world…and one of the points that he’s MAKING in the paper is that we have NO REASON to assume that they have ANY sort of phenomenal stream of consciousness that resembles ours, where it FEELS like something to be a bat. That there are a billion ways that animals could have evolved to navigate their environments that have nothing to do with the type of consciousness that WE experience."
    },
    {
        "text": "More than that…if you combine that line of thinking, with the existence of something like blindsight. Where I don’t know if you saw this story…but it’s INTERESTING, YEARS back…back in 1965…scientists were doing a study on the neuropsychology of vision at the University of Cambridge where as part of the process they had to REMOVE the visual cortex of a monkey named Helen. And obviously AFTER that… she was COMPLETELY BLIND…in terms of there being ANY sort of phenomenal awareness like WE have as human beings."
    },
    {
        "text": "But then one day when the lead scientist was out at a conference…one of the researchers started PLAYING with Helen and giving her treats. And as he kept GIVING her the treats, I think it was a piece of apple…she strangely…started to be able to KNOW…which HAND the apple was in. But she ALWAYS seemed a little UNSURE of herself he said later. Didn’t quite know why."
    },
    {
        "text": "Then she started to be able to identify flashing lights. Fast forward to a couple years later and she was able to navigate obstacles of DIFFERENT sizes and shapes…I mean there’s VIDEO of it on YouTube it was as THOUGH she could see…it is CLEAR she has awareness of what is around her…but she’s not seeing things the same way that we’re seeing things. So HOW did she DO it?"
    },
    {
        "text": "The THINKING of the scientists was that there are two main pathways where the eyes connect to the brain. One of them, the USUAL one we think about, goes up to the cortex which Helen had removed…and the OTHER is an ANCIENT one that’s descended from the visual system used by fish, frogs and reptiles."
    },
    {
        "text": "Seeing what Helen was doing they thought COULD IT BE…that Helen was now perceiving the world using this ANCIENT type of navigational system where she’s able to navigate and KNOW that objects are in certain places… but she DOESN’T have the unified visual STREAM of consciousness that WE associate with being able to see."
    },
    {
        "text": "They called this phenomenon BLINDSIGHT. And since then it has been well documented, not just in monkeys…but in PEOPLE. PEOPLE that have BRAIN DAMAGE where they CAN’T SEE on one side of their visual field…doctors will HOLD UP…SHAPES in their BLIND SPOT…and they can TELL the doctor what SHAPE it is…but they DON’T really know HOW they know that its that shape. They just have a STRONG INTUITION about it and HAPPEN to be right."
    },
    {
        "text": "Point is…COULD it be. That our minds are receiving a TON of information at different levels that are not all available to us in that CONSCIOUS STREAM that WE’RE familiar with… where there’s a self, and a conception of time, a conception of identity. Could it be that MOST of the information we get we are NOT immediately, consciously aware of…but we’re able to ACCESS it through something like what we call intuition or INSTINCT. That the SELF doesn’t EXIST at this level of processing, so it’s mysterious to us as to where these intuitions are coming from…but that ULTIMATELY…this is a possible explanation for how something can APPEAR to act conscious from the outside, but not actually BE conscious. Like the zombie."
    },
    {
        "text": "It’s easy to see Helen…navigating a room full of obstacles… and to think she MUST be having an experience that’s similar to the one I’m having."
    },
    {
        "text": "And then it’s EASY to be selective, right? Like you see an animal do something… that if it was a PERSON doing it you’d INSTANTLY say that it was cruel…like a bear that eats the babies of another bear, that kind of stuff happens all the time…and when it DOES we DON’T hold that bear morally accountable for that…because no, it’s operating based on instinct. It can’t POSSIBLY have a conception of the DAMAGE it’s doing there. But then when a bear does something sweet…oh well this must be one of the GOOD bears…it just wants to play and make a friend."
    },
    {
        "text": "There’s a WHOLE RANGE of potential experiences that animals could be having…and NONE of them by ANY MEANS…absolutely HAVE to have the type of subjective experiences that we have included in it. In the SAME WAY an algorithm like GPT4 is given a level of HUMANNESS that it ONLY has because we’re PROJECTING it onto it when it’s doing human-like things. Animals COULD BE a type of biological algorithm playing out where they perform COMPLEX biological functions…but LACK the subjective experience that WE have."
    },
    {
        "text": "Maybe when I’m at the park and I’m talking to a dog like its a person, being all nice, like it KNOWS that it’s a dog or something…maybe that’s me being like one of those dudes on the internet that falls in love with chatGPT, and then an update comes out and they feel like they just got ghosted on a dating app. What if I’m doing a LOT OF WORK that I DON’T realize that I’m doing PROJECTING HUMANITY onto this thing that isn’t human."
    },
    {
        "text": "Now if ANY of this sounds to you like an intellectual justification for creating a HIERARCHY of conscious experiences. That’s EXACTLY what I’m doing. This is the potential COST of these conversations about consciousness."
    },
    {
        "text": "People ALREADY create consciousness hierarchies based on almost nothing. How many people will eat a FISH but they won’t eat a chicken. Or they eat CHICKENS but they won’t eat a cow. People will cite real REASONS WHY they THINK about consciousness IN this way. \n\nAnd part of this WHOLE exercise is thinking about HOW society might play out if we adopt DIFFERENT PRECEPTS about the nature of consciousness. So here’s what I’m gonna do…like some goofy looking podcaster pretending to be the ghost of christmas future…I’m going to try to show you a vision…of what the world might look like… if we all more or less just accepted that phenomenal consciousness…is ONLY something that human beings possess. What might happen…if a society was centered around not the sanctity of LIFE anymore…but the sanctity of HUMAN consciousness?"
    },
    {
        "text": "Would everybody be UNIFIED in that world? Would we all just hold hands together under the banner of consciousness? Everybody’s on TEAM HUMAN! Forget all these petty EXTERNAL differences that used to DIVIDE us. Right."
    },
    {
        "text": "Well how bout this though would people just more GENERALLY…be interested in exploring their own CONSCIOUSNESS, because they’d see it as a foundational aspect of who they are? Would therapy be more popular? Would more people become neuroscientists instead of theologians? Would we TEACH how to NAVIGATE your own consciousness in schools? Would we have kindergarteners meditating at recess? All interesting things to consider."
    },
    {
        "text": "But what happens when society gets a FREE PASS to think of animals as biological algorithms that we don’t have to consider the feelings of? Does everything NON-CONSCIOUS in this type of society…become just a RESOURCE to improve the state of CONSCIOUS beings?"
    },
    {
        "text": "The low hanging fruit here is obvious. If ANIMALS are algorithms the same way that chatGPT is an algorithm…then there is ZERO REASON to feel bad for USING animals the same way you use chatGPT to write your resume. So of COURSE you can EAT animals in that society. OF COURSE you can farm them. And OF COURSE you can do animal testing. What does it matter?"
    },
    {
        "text": "More than that…why NOT use things that are NOT conscious…EVEN for my own AMUSEMENT as a conscious being?"
    },
    {
        "text": "Why NOT have AMUSEMENT parks like SEA WORLD…where you got orcas and dolphins performing all day…if EVERYONE in society accepted that these are just conscious LOOKING biological algorithms…as long as we have enough orcas? Who cares? And even BETTER than that…why not have monkeys that ride around on motorcycles? That’d be pretty cool. Why not have interspecies MMA matches? I mean there’s a LOT of ideas you could come up with that may give someone a pleasurable conscious experience if that’s what mattered to you the most."
    },
    {
        "text": "Why not CHOP DOWN the trees in your backyard that are blocking your view of the sunset?"
    },
    {
        "text": "And again, if it’s ABOUT the sanctity of consciousness and NOT about the sanctity of life…think of how that changes something like the abortion debate in that society. Not that it SOLVES anything…but imagine if people were arguing about abortion rights and weren’t trying to determine where LIFE begins…but where PHENOMENAL CONSCIOUSNESS begins. You’d HAVE to ask the question: IS consciousness something that is INJECTED into JUST HUMAN life at conception, NOT into animal life…OR is consciousness something that is developed AS the BRAIN develops. Is consciousness something where MULTIPLE departments of the brain eventually coalesce INTO what WE think of as a unified, subjective experience with a SELF or an IDENTITY? And in the case of abortion conversations in PARTICULAR, if we’re CONSIDERING consciousness as the PRIMARY thing: how about the conscious experience of the woman that has to carry the baby to term? How about the conscious experience of the future baby?"
    },
    {
        "text": "See because: if a society was willing to create a HIERARCHY, BASED around the QUALITY of conscious experiences, where ANIMALS are thought of as at a lower level. There is almost ZERO chance that ISN’T going to extend into consciousness hierarchies AMONG conscious people."
    },
    {
        "text": "Because it’s NOT JUST the NATURE of consciousness that can be turned into a hierarchy. It’s the NURTURE of consciousness as well. SETTING ASIDE the possibility… that in this hypothetical society, we’d come up with some STANDARD of conscious experience…where depending on how well you culturally match up with it…that determines your level of worth. Let’s pretend we would NEVER do something like that."
    },
    {
        "text": "But how about something like end of life care? How might THAT change? Where, as your cognitive capabilities decline…you’re just seen as less and less important… because your conscious experience is getting closer and closer to that of an animal’s. Or maybe from ONE perspective…it might IMPROVE it in some cases…you know instead of valuing the preservation of LIFE at all costs as people sometimes do now…maybe people would start thinking about how to preserve the quality of conscious experiences that someone has left."
    },
    {
        "text": "But how about just aging in general? What if in this society…after you reach a scientifically determined PEAK age of conscious awareness…then the older you get, and the lower scores you put up on the yearly consciousness test you do when you get your physical…the less that society sees you as being entitled to a seat at the table when it comes to anything."
    },
    {
        "text": "People would have NO REASON in this society to feel bad for OPENLY DISCRIMINATING against people for age or for disabilities…and you can imagine what it might feel like BEING somebody there…if CONSCIOUSNESS hierarchies like this were just the accepted standard…you would feel the SAME way discriminating against someone for their age as you feel right now telling a kid that they can’t drive a car. I’m sorry, you just can’t. It’s not good for the REST of us conscious people out here trying to survive"
    },
    {
        "text": "When we set up these consciousness hierarchies…we HAVE to understand the criteria that we’re USING and what THEORIES in the philosophy of mind we might be BRINGING into it. Because if you’re willing to set up a distinction between fish and chickens in your own head because one of them seems to have a degraded conscious experience…then you gotta ask the further questions: if a human being…had a degraded conscious experience because of brain damage or whatever else…can we EAT THEM at that point? Can we put them in little mazes and use them for experiments testing how they react? Well was it okay to do with Helen the monkey? Is it okay to do it with rats? Is it okay to keep animals in zoos? Is it okay to have pets?"
    },
    {
        "text": "These conversations are important to have. If IN these examples of a hypothetical society you see GLIMMERS of how some people out there actually DO look at the world, and they bring these points up PROUDLY in casual conversation…then you must REALIZE the relevance these conversations about consciousness can have."
    },
    {
        "text": "The point is this ALL OF THIS STARTED… with a hypothetical ZOMBIE… in a thought experiment that to some could seem like a TOTAL waste of time to even talk about. But here is a REAL WORLD EXAMPLE of how the INFERENCES we MAKE about the conscious states of other creatures…go on to have REAL effects on personal and public moral policy."
    },
    {
        "text": "At a certain point: like ALL giant precepts that most people take for granted that GUIDE their moral decisions…at a certain point…if you’re one of the unfortunate few who care enough to listen to a podcast like this…you’re going to have to accept that even though you don’t have complete information about this stuff…you still…HAVE to make…a choice moving forward about WHICH of these tentative theories you’re GOING to accept for now. And WHEN YOU DO…it is GOING to have IMPACTS on the way that you see everything."
    },
    {
        "text": "Now if accepting this TYPE of BEHAVIORISM…where we can’t tell if something is conscious just because it BEHAVES like something that’s conscious…if THAT’S an exercise in imagining what if consciousness that SEEMS like it may be there is NOT ACTUALLY THERE. Then what if we FLIPPED that around? What if things that DON’T appear to be conscious…actually are? What if EVERYTHING is conscious? Why do SOME philosophers claim that PANPSYCHISM as its called is MAY BE the most LIKELY answer to the hard problem of consciousness…and how might society be radically altered if everyone one day just decided it was what we wanted to structure our societies around?"
    },
    {
        "text": "That’s at least how next episode will begin. Thank you to everyone who makes this possible by subbing on Patreon. Philosophizethis.org is the website."
    },
    {
        "text": "Thank you for listening. Talk to you next time."
    }
]