[
    {
        "text": "So the other day I was taking a walk around my neighborhood with my friend at like 4:30 in the morning. It was about 20 degrees Fahrenheit, well below freezing. Ground’s covered in frost and black ice, it’s pitch black outside… I’M sliding around everywhere trying to get a morning walk in like a COMPLETE genius here. And my friend who doesn’t read any philosophy turns to me as we’re doing this and he says, so this GUY you’re talking about…Giorgio Agamben…what’s HIS whole deal, you got any idea of what you’re gonna be saying yet? And right when he asks me im walking downhill and I hit a giant patch of black ice…and im just sliding downhill…and as I’m Tokyo drifting down the sidewalk of my neighborhood my head’s in another place and I say back to him well look one of the FIRST things you gotta know about him is that he’s not a big fan of human rights. That’s what I led with."
    },
    {
        "text": "And he looks at me and he’s like WHAT? Who is this guy Chairman Mao? What kind of monster is against the concept of human rights?"
    },
    {
        "text": "And this is such a PURE response from anybody that’s been RAISED in western culture… that’s come to know human rights as one of the most SACRED things we have as part of our political process. It was MY response when I first heard about these ideas years ago. And it can be so mysterious at first: why would a philosopher like Giorgio Agamben be SO CRITICAL of something with such good intentions behind it? Something that really at bottom is just trying to protect the dignity and freedom of people going through dangerous times."
    },
    {
        "text": "Well if you’re somebody that’s been listening to every episode of this podcast for about the last year or so…you MAY remember, there was ANOTHER person we talked about recently that ALSO had a problem with human rights. I’m talking about Simone Weil. One of my personal FAVORITE philosophers, a woman Giorgio Agamben did a dissertation on when he was in school, a woman he has a tremendous amount of respect for, and someone it’s NOT CRAZY TO IMAGINE…may have INFLUENCED this AREA in his thinking."
    },
    {
        "text": "See Simone Weil thought that human rights… no matter how GOOD they may make people feel…they’re actually missing the point when it comes to what it is they’re trying to protect. One of the PROBLEMS she says is that human rights fundamentally are always trying to reduce humanity… down into the language of legal or commercial discourse. But that’s impossible she thought."
    },
    {
        "text": "Remember she had a GREAT example written down in one of her journals. She says to imagine a farmer that goes down to the farmer’s market. He’s gotta BUNCH of chickens. Look at all those chickens. And she says this FARMER…has a LEGAL RIGHT…to SELL his EGGS down at the farmers market for as much as he wants…he has the right to sell them for $20 a dozen if he wants to. He ALSO has the right to go out of business when no one wants to pay $20 for a dozen eggs."
    },
    {
        "text": "Now CONTRAST that she says with someone forcing a woman into prostitution. Now of course EVERYBODY knows this is wrong, it’s SO wrong there’s not a debate to be had. But Simone asks in her journal: is the REASON it’s wrong to FORCE a woman into prostitution because she has a legal RIGHT to NOT be a prostitute? Well no, that’s LUDICROUS she says. The reason it’s wrong is because you’re robbing some piece of what it is that makes her a person. You’re stealing her humanity in a way. Her POINT is: there’s a sense in which trying to DEFINE these sorts of things in LEGAL TERMS…ends up MISSING something that’s important about the whole process of protecting human dignity and freedom."
    },
    {
        "text": "Now Simone Weil ALSO says that rights are obviously not the most EFFECTIVE thing in the world…you want PROOF of this just look at any time an actual Hitler or Stalin comes around…any time a country decides to declare war and invade the neighborhoods of another country…those human rights go right out the window…they’re worth about the paper that they’re written on. Both Simone Weil and Giorgio Agamben ask in their own unique ways: could there BE a more effective strategy out there?"
    },
    {
        "text": "This is the place in the conversation that Giorgio Agamben starts to develop his OWN critique of human rights. And fair warning: some of these points are no doubt going to move the needle. I’d just like to take a second to remind everyone that I am not a political ideologue, in fact far from it. I am but a humble podcaster. I like to entertain ideas that I don’t necessarily accept. That’s part of why people COME to this podcast to get exposed to things that make them see the world from a different angle. Just ask that you direct all scathing responses to giorgio.agamben@definitelynotstephenwest.com."
    },
    {
        "text": "Anyway, BUILDING off of Simone Weil’s point he’d START by saying of COURSE people like Hitler are not gonna follow your little Geneva Convention. Yeah turns OUT… a guy with THAT kind of mustache is not exactly persuaded by you sending him a strongly worded letter expressing your disapproval of him. And not ONLY are human rights not even CLOSE to stopping people from being brutalized, just look at what’s going on in the world right now. The REVERENCE…the unquestionable RESPECT that people in the western world GIVE to human rights…you know, the kind of thing that makes people go WHAT? Who wouldn’t be for human rights…that respect…Agamben thinks it ACTUALLY makes human rights a concept… that creates new opportunities for imperialist regimes all around the world."
    },
    {
        "text": "How OFTEN… are human rights used as a smoke screen or a justification… to invade a country and HIDE the true intentions behind starting a war? I’ll try to give a balanced perspective here: how about the United States invading Iraq in 2003. There were a lot of reasons that were given for WHY we should be invading a country that didn’t attack us. Weapons of mass destruction was a reason given for sure. But another MAIN REASON that was GIVEN was that we are the LEADERSHIP of the world…and we have to spread DEMOCRACY and FREEDOM to that entire region. That we have a moral obligation to SAVE these people who are being tortured under the regime of Saddam Hussein. In other words: it was a humanitarian effort! Women are being treated horribly. Apostates are being murdered. We were TOLD in the United States on our TVs that they didn’t even have a SINGLE KFC in ALL of Baghdad. It had gone too far. We HAD to do something about it."
    },
    {
        "text": "You know it WASN’T because we wanted a foothold in the region, to have more political control over an area of the world that we wanted to have influence over . It wasn’t that we wanted to control the oil wells that if Saddam Hussein chose to manipulate them would have potentially catastrophic effects on the global economy. It wasn’t any of THAT. It was that we CARE too much about the people. Sarcasm aside, to Agamben, you can SEE how the LORE that surrounds human rights can sometimes be used as a smoke screen for the TRUE political motivations that underlie an aggressive move like that."
    },
    {
        "text": "Said I’d be balanced so let's take an example from somebody NOT the United States. MANY examples of the same thing going on from both Russia AND China. Take Russia invading Ukraine in 2022…or Crimea in 2014. Again, MANY reasons were given for that invasion. But one of the primary ones was that ethnic Russians, Russian speaking people who mostly IDENTIFY as Russian are VICTIMS of terrible human RIGHTS violations going on in Ukraine. WE gotta go SAVE em! We have a moral duty, as an incredibly caring and loving nation, to protect these innocent people who cannot protect themselves."
    },
    {
        "text": "You know it’s NOT because Ukraine is the only neutral state between you and NATO and that NATO has been progressively trying to court Ukraine for years to join their alliance. It’s NOT because Ukraine has been increasingly modernizing in recent years, more capable of refining their own oil and that if they were to do that you wouldn’t be the only oil state in the region that could provide energy to Europe. It’s NOT because just geographically from a military strategy perspective taking Ukraine to the western mountain pass just puts you in a far better defensive position SHOULD a war ever break out between Russia and NATO. It’s NONE of those things. We JUST…CARE about the people, they have rights…and by golly do we just gotta respect the bajesus out of em."
    },
    {
        "text": "Once again sarcasm aside…Agamben would say look at how the TRUE political motivations can get obscured when you can dangle something like human rights in front of people that most of us think it would be insane for ANYONE to ever question."
    },
    {
        "text": "Human rights…have been the CENTRAL focus of western politics SINCE the end of the Cold War. Which raises ANOTHER problem with human rights to Giorgio Agamben…because they’re so monolithic in western political discussion…they actually end up PREVENTING us from talking about issues that are ALSO very important. Say income inequality, climate change, nuclear proliferation. All issues SOME would say are neglected, because MOST of our time is spent agonizing over which human rights should be written down on a piece of paper, just to be TRAMPLED on by the NEXT people in power."
    },
    {
        "text": "To Giorgio Agamben, the path forward is not that we need to just rethink or redesign human rights. HE thinks we’re far past that point…that BECAUSE of the way HISTORY has gone down we have SO MANY preconceived ideas about rights… that the BEST solution to HIM… is to find a political strategy that actually moves BEYOND human rights to something better."
    },
    {
        "text": "What sorts of preconceived ideas well how about that our rights include life, liberty and the pursuit of happiness…you now the assumption that our biological lives and free life choices… are things INTRINSICALLY tied up in what the government should be protecting. This connection permanently leaves room for what Agamben calls Biopolitics, where it’s seen as NORMAL for the government to control aspects of people’s bodies, how they USE their bodies, what sorts of lifestyles are acceptable for a citizen to have. When EVERYTHING about our human rights can become politicized…to Agamben it becomes easier for people to accept that it’s the government’s job to be controlling these things."
    },
    {
        "text": "But there are OTHER preconceived ideas about human rights. How about our assumption that human rights are inalienable, self-evident, some say God given…this is the kind of language that is USED…people will that there’s something universal about them that applies to every person in every POSSIBLE situation…but if you were to just ANALYZE that extreme, oversimplified statement…you’d recognize that these are fundamentalist views. Nothing, not even human rights, can EVER be universally applied like that because the CONTEXT of every situation matters…but good luck convincing people of that have grown up in a fundamentalist culture."
    },
    {
        "text": "Agamben would say IF you think these human rights are SO effective at protecting people’s dignity and freedom…just consider a couple things: NOT ONLY… how quickly something people have so much confidence in disintegrates the second something extreme happens, but ALSO how quickly people are to suspend somebody ELSE’S sacred human rights the second their government labels them an enemy of the state."
    },
    {
        "text": "More on that in a second, now if the START of this episode has been a bit HEAVY of a topic for you don’t worry, next up, Agamben’s gonna dial it back a bit he’s gonna talk about something a little lighter, little more upbeat. How about we move along to…Nazi concentration camps in WW2 Germany. THAT seems like a pretty good direction to go in."
    },
    {
        "text": "He says you know it’s funny…MOST people when they think back to the Nazi concentration camps in WW2…most people are appalled; they’re disgusted. NOBODY out there…wants to see something like that happen again, so we remind ourselves of the images, we REFLECT on what human beings are capable of in their worst moments and we continue on with our lives proceeding with EXTREME caution in this area, NEVER AGAIN."
    },
    {
        "text": "But what Giorgio Agamben would say is that while that MAY be how a LOT of people see it. To SOME people out there…what happened with the Nazis was not some historical anomaly that they’re disgusted by…no, specifically to people who are in positions of power, whose LIFE it is to find more and more effective ways of controlling people…to THESE people Nazi concentration camps were an absolute masterclass by Adolph Hitler in how to make an entire RACE of people into a subhuman class that he can THEN do anything he wants to… and FACE no legal consequences."
    },
    {
        "text": "In other words to Giorgio Agamben there are certain people in power…that took INSPIRATION from the model of the concentration camps. The way THESE people think about it…look the OPTICS of the concentration camps may have been bad, the death marches, millions of people dead and everything…but they ALSO think what if we could take… that political sleight of hand that Hitler used to JUSTIFY the concentration camps, mold it into something a bit more subtle, but STILL be able to control people in a way where their basic rights are violated, and TECHNICALLY everything we’re doing is perfectly legal."
    },
    {
        "text": "You’ll see the SAME STRUCTURE of Hitler’s concentration camps manifest in completely MODERN political strategies in the year 2023. We’ll give plenty of examples, but to see the similarities, to Agamben…we have to start by asking a pretty philosophical question…we have to ask what EXACTLY…are you TAKING from someone…when you FORCE them into something like a concentration camp?"
    },
    {
        "text": "Ultimately to answer this… Agamben is gonna reference a couple ideas from Aristotle about what constitutes a free and dignified human life. Two concepts in Aristotle’s work… that are OFTEN seen as connected together…the concepts of Zoe and Bios. One simple way of thinking of these two things is that Zoe is the part of human life that we sometimes call the PRIVATE realm…and Bios is what we often call the PUBLIC realm. Zoe is the ability for someone to live privately, at home, with autonomy over their own biological, natural life. Bios is the ability to participate in society PUBLICALLY or politically, to have legal representation, the ability for someone to participate in a way of life that they choose for themselves, at all."
    },
    {
        "text": "Now BOTH of these are crucial elements if you want to have freedom and dignity.  And to Giorgio Agamben, when someone is thrown into one of Hitler’s concentration camps…BOTH of these crucial elements of life are robbed from them…and they end up existing somewhere OUTSIDE of these categories, where they’re still ALIVE…but they’re essentially already dead."
    },
    {
        "text": "As they continue to exist…he says their lives are STILL PART of the political discussion that’s going on…but they have no political representation or ability to participate. They HAVE physical bodies that they’re using to move around…but they HAVE no right to privacy or CONTROL over that physical body. They exist in a place of purgatory…what Agamben calls Bare Life. And human rights written down on a piece of paper don’t APPLY to people in this spot…because the way they GOT there the FIRST place…was because somebody in a position of power, say Adolph Hitler, DECLARED a state of emergency during wartime, SUSPENDED civil liberties, SUSPENDED civil rights, legal due process…LABELED an entire GROUP of PEOPLE…either an enemy of the state, a terrorist, ASSOCIATED with terrorists, an enemy combatant…doesn’t really matter WHAT it is, POINT BEING…the political maneuver here… is that once you can get people into THIS TYPE of dehumanized place…Hitler realized you can do WHATEVER you want to them…and it’s all technically LEGAL under the laws of that country."
    },
    {
        "text": "This is an extension of a criticism FIRST put forward by the philosopher Carl Schmitt. And if you remember from the episodes we’ve already done on him…he was not a big fan of constitutional, classical liberal democracies like the ones we see dominating the western world today. He thought that whenever you have a constitution…and you have checks and balances built into your political system so that no one president can ever change anything too much…that SOUNDS great and all. But IN PRACTICE he says…whenever something sufficiently BAD ever goes down in the world…ALL that actually happens is the people in power declare a state of emergency…and then they get extra-constitutional power to be able to do whatever they want anyway. So is the constitution just another example of something like human rights that makes everybody FEEL really good…but whenever push comes to shove its worth about the paper that it’s written on?"
    },
    {
        "text": "Executive orders, wartime operations without the approval of congress, the patriot act, unwarranted surveillance…these sorts of things are NOT the state of exception or the state of emergency…to Giorgio Agamben… these days the state of exception has become the RULE. And when he TALKS about this stuff in the early 90’s people actually think he’s insane. Like a conspiracy theory guy. NO government out there is declaring a state of emergency and then suspending civil liberties and due process. But by the mid 2000’s… that SAME book that he wrote that people thought he was crazy for…became one of the most cited academic resources in the world for the beginning of the 21st century."
    },
    {
        "text": "So let’s talk about some REAL WORLD EXAMPLES of this political maneuver being used in practice to control people. And I want you to picture a spectrum. Where on ONE end of the spectrum you have Nazi concentration camps, a very ABNORMAL, EXTREME example of this political tactic being used…and on the OTHER side of the spectrum are examples of this political tactic that are NORMALIZED, things  we experience every day. Something like the digital panopticon we’ve been talking about, something SO NORMAL and routine… that people can actually be LIVING in it and not even REALIZE that it’s going on. We’re gonna talk about ALL the different shades of gray that exist BETWEEN these two extremes… with each EXAMPLE I’ll take it down one more NOTCH into something that may seem more NORMAL to us."
    },
    {
        "text": "And just as a heads up: NOT EVERYBODY is gonna agree that all of these are examples of this same political maneuver being used to control people. People are gonna fall off at every notch that we go down as the examples get further away from the concentration camp and more and more normalized. But I really think… this is a GOOD way to find out where you stand in agreement with Agamben’s critique…because an exercise like this will show you the boundaries of where you think this IS a valid point he’s making, and then also where it seems like maybe we’re talking about something entirely different."
    },
    {
        "text": "See, Agamben’s gotten some backlash in recent years where his critics say he is trying to apply this theory to areas where it’s not really appropriate. Then again no doubt SOME of you out there will see this as a perfectly valid breakdown of the CORE political strategy at work in all of these different examples."
    },
    {
        "text": "So if we START at Nazi Concentration camps…a real world example that’s one step DOWN from there… could be something like Guantanamo Bay or Abu Ghraib."
    },
    {
        "text": "The United States declares a war on terror, they invade Iraq, they invade Afghanistan, there is special power GIVEN to people in a state of war, the people in power DECLARE a certain TYPE of person an enemy combatant or a terrorist…and WHEN they’re captured, they can be taken to a place like Guantanamo Bay Cuba where they instantly become an example of this class of person that’s treated as though they’re subhuman and are DENIED of both their public and private life. Meaning they’re not protected by the rights of their home country, they’re not protected by the rights of the United States, they obviously don’t have any political representation, as prisoners obviously they don’t have a right to privacy, they can be waterboarded, they can be forced to listen to the soundtrack of Frozen 400 times in a row, which, any parent can tell you is actually worse than being waterboarded, point is they can be locked in a cage with no due process and ANYTHING can be DONE to them…simply because they’ve been labeled an enemy combatant, through this political maneuver that Agamben says is becoming more popular."
    },
    {
        "text": "So that’s ONE example…let’s take ANOTHER step down and talk about something a LITTLE more normalized in the world: how about police brutality against african americans. COULD it be said that this is ANOTHER example of police officers or people in power…that LABEL a particular group the ENEMY…where in SOME cases they choose to ROB them of due process and legal rights…in OTHER cases they DENY them a private life by increased patrolling where they live, shakedowns, demanding IDs, could it be said that this is the SAME CORE POLITICAL STRATEGY being used AS was used in 1930s Germany? Some people may say that it is. Others may say we’re talking about something entirely different."
    },
    {
        "text": "Okay. ANOTHER example…and again let’s move in the direction of things that are more normalized to us…something that EVERYBODY listening to this can relate to: how about the stay at home orders and the lockdowns that went on during the pandemic in 2020 and 2021."
    },
    {
        "text": "Needs to be said at the top here: THIS, is one of those areas that some people start to disagree with Agamben and his characterization of what was going on."
    },
    {
        "text": "What Agamben says is that while obviously being told to stay home and get a vaccine is NOT the same as being forced into a Nazi concentration camp…this is a PRIME example of the same kind of political maneuvering where people are DENIED of their rights. People in power telling citizens they can’t move around in the world freely, they can’t go to work, they can’t practice their religion the way they want to, they can’t bury their dead in some cases. To Agamben this is a clear example of the government declaring a state of emergency, and then USING those augmented powers to deny people the ability to participate in a public way of life, to DENY people access to a private life with autonomy over their body by mandating that people get a vaccine and a card signed off by a doctor to be able to eat in a restaurant, AND it creates a situation to him where the people in positions of power can make an ENEMY out of you if you don’t play along, and then come after you disproportionately simply because this is a public health emergency."
    },
    {
        "text": "This is ALSO a great example he thinks of how NORMALIZED this suspension of civil liberties has BECOME to people…because just look at how QUICKLY most people were to ACCEPT that this was just their new way of life."
    },
    {
        "text": "Now the people that disagree with Agamben here will say that when it COMES to suspending civil liberties in the interest of public health. The INTENT behind the actions of the people in power…MATTERS A LOT. They’ll say to even TALK about Nazi concentration camps in the same sentence as COVID restrictions…just starts to come off as disingenuous. The intent behind the Nazi concentration camps was to exterminate an entire race of people off the face of the planet. The intent behind covid restrictions…was to SAVE lives. It’s just not the same they’ll say. And again I leave it up to YOU the listener to decide which of these you think are valid and which ones are overstepping. But Covid definitely is one that HAD to be included on this list just because of how outspoken he’s been about it in the last couple years."
    },
    {
        "text": "Moving on though, another example…little more normalized. How about something like international travel? Giorgio Agamben refuses to travel into the United States anymore. He actually used to have a prestigious position at NYU…but in the aftermath of 9/11 they were going around to NYU employees and asking them for their fingerprints as a way to ensure security…he didn’t wanna have any PART in it…so he QUIT and never came back."
    },
    {
        "text": "And this is the SAME line of thinking… that makes him refuse to travel to the United States to this DAY. Because when you’re TRAVELING to the United States from another country…say you’re coming from Kazakhstan. Beautiful country. One of the most underrated on planet earth right now by the way. But let’s say you’re coming from Kazakhstan to the US…WHEN you touch down on US soil…you are not protected by the laws of Kazakhstan where you came from…you are not protected by the full rights that someone in the United States has…technically you haven’t even ENTERED the US yet. You exist in a place of purgatory… where customs agents DON’T have to honor your privacy or legal rights. They can take fingerprints from you, they can demand documentation, they can take pictures of you and upload it to image recognition software, they can search through every square inch of your bags…and by the way every square inch of every orifice on your body if they decide it sounds fun that day. ALL of these things just PERFECTLY REASONABLE in the interest of national security…but the SECOND that person coming into the country steps out of customs onto US soil…the police CANNOT just walk up to you and demand your fingerprints or documentation if they don’t suspect you of a crime. Yet ANOTHER example Agamben thinks of this political maneuvering that MANY people have just come to accept."
    },
    {
        "text": "The LAST example I’ll give is the life of an average citizen IMMERSED in the sort of digital panopticon we’ve been talking about on the SHOW recently. COULD it be said…that if you live in a country where money is directly tied to politics…and unless if you’re a multi-millionaire or a billionaire you feel politically disenfranchised and unable to really affect anything…where in that life your every movement is captured by CCTVs and you come home from work every day and are subjected to surveillance on a level where you don’t really have access to privacy. Is it a STRETCH… to say that the digital PRISON of the panopticon puts people in a similar sort of place where they’re denied the sort of free and dignified life that people experienced in the past?"
    },
    {
        "text": "Regardless of which of these examples you agree with or don’t…Agamben would say it’s important for us to continuously look at the events that are going on in the world… the people that are being essentially kept in prisons or concentration camps without having ever been convicted of a crime and NO hope of getting OUT of it…he’d say it is crucial…for us to remain CAUTIOUS of this political strategy being accepted as just something that’s completely normal. How many people are being locked in cages both literally and metaphorically…simply because someone in power, somewhere decided to label them as associated with an enemy group?"
    },
    {
        "text": "Another interesting criticism Giorgio Agamben has of modern western society is that if you pay attention to the way that MANY of the institutions are designed…the whole thing… SEEMS to be organized in a way that doesn’t really value potential. And he means potential in a very general sense you know you can imagine a seed…and in actuality it is just a seed. But it ALSO ABSOLUTELY carries with it a sort of latent POTENTIAL to become something like a fully formed plant. There’s a relationship between potentiality and actuality and modern society, it seems, doesn’t really value potential in a meaningful way. In fact it seems to actively want to SQUASH potential. Some examples of what he means:"
    },
    {
        "text": "Take the public school system for example. There’s a way this business is conducted. Teachers don’t look at each and every student, identify their strengths, see their potential as an individual and what they may be able to go on to do to impact society in the greatest way possible, and then encourage that potential. No, what WE do…is we give kids a standardized test at the end of the year to measure how many facts they’ve memorized. And what happens in practice is that teachers… will often teach the children JUST so they can do well on that standardized test where the numbers matter. Their potential as a human being… isn’t even really something that crosses their minds."
    },
    {
        "text": "But then that kid graduates from school and ends up going into the work force. Corporations are ANOTHER example of a place in modern society where they’re not looking at each employee and considering what they have the potential to grow into, maybe even revolutionize the company someday. No, companies focus… on productivity, profit, they give employees very clear tasks with very clear deliverables that they have to accomplish every day."
    },
    {
        "text": "Another example can be found in prisons. When someone commits a crime…WE focus a lot on the punishment side of things…we focus on them doing the hard time so they can pay their debt to society. In other words: there’s no focus on the prisoners as individuals with potential, where their time in prison could be spent becoming something that could benefit society the most when they get out. We focus on punitive measures."
    },
    {
        "text": "Anyway POINT is: potential to Agamben is this MASSIVELY important thing if we EVER want to visualize society in a way that makes the world a better place…and yet it can SEEM sometimes like entire institutions don’t want to consider alternative, potential realities at all. Potential, to Agamben, although it can SEEM like such a simple thing, potential actually has the power to BE something that people can be UNITED under, a common banner that’s trying to bring about a better world where the typical TRIBAL dividing lines between people aren’t as pronounced."
    },
    {
        "text": "Case in point: take the example of the civil rights movement in the United States."
    },
    {
        "text": "When people gathered together to march on Washington, protesting the way things were and imagining the potential of a DIFFERENT world where a group of people were treated better…NOBODY out there was saying no you can’t MARCH with us today for this cause…because you come from the wrong country. Or you don't LOOK the right way. Or because you’re not the right gender. Or because we disagree about some OTHER political issue. No EVERYBODY regardless of what immutable characteristics they were born with were welcome as long as they believed in the vision of a potential world where things were better. Well if a subcommunity like that can be formed on the basis of encouraging potential…what if an entire COMMUNITY or society could be formed on that basis?"
    },
    {
        "text": "Anyway…there’s gotta be at least ONE of you out there that have been listening to the show lately…hearing all this discussion about power dynamics and these investigators like Foucault and Agamben talking about how power operates in the modern world…and there’s gotta be someone out there who has had the thought that what the REAL problem is…is NOT that we have all this increased surveillance, that there’s a connection between knowledge and power, or political tactics that dehumanize people…this person may think the common denominator in all these tricky situations we find ourselves in…is really the fact that there’s a centralized, sweeping authority that we call the government…that exists at all."
    },
    {
        "text": "Maybe we don’t even NEED something like the government. Now Anarchy…AS a political philosophy…things like this are some of my favorite things to read about and get into if for NO other reason…that if you’re someone who’s never done a deep dive on it on the surface…it just sounds so STUPID…as a philosophy. Like there are FEW things better in this world than hearing an idea that sounds RIDICULOUS from an outsiders point of view, sitting next to the fireplace with a book about it and being like well let’s see where THIS thing goes."
    },
    {
        "text": "It’s an episode I’ve been wanting to do for a while now. It is IMPOSSIBLE for it to not be valuable to the discussion we’ve been having. At WORST this is going to show you that anarchist…is not just a phase you go through in college because you got a parking ticket and now you hate the government. There’s actually brilliant people dedicating their lives to try to answer these questions. As always if you want more Agamben or ANY thinker we’ve been discussing lately you know what to do. Just post a comment that says MORE Agamben or MORE Nussbaum. I truly am a spaniel at thy gate. Use me for what you will."
    },
    {
        "text": "Thank you for listening. I’ll talk to you next time."
    }
]